Modelagem/Model.puml
@startuml SmartAuto
skinparam defaultFontName Hasklig
skinparam dpi 150

enum Role {
  VENDEDOR
  GERENTE
  ADMIN
}

class Funcionario {
  -_id: uuid
  -_usuario: str
  -_senha: str
  -_nome: str
  -_telefone: str
  -_role: Role

  +Funcionario(id: uuid, usuario: str, senha: str, nome: str, telefone: str, role: Role)
  +realizar_venda()
  +realizar_locacao()
  +inserir_vendedor()
  +remover_veiculo(veiculo: Veiculo): bool
  +remover_cliente(cliente: Cliente): bool
  +remover_gerente(gerente: Funcionario): bool
  +remover_admin(admin: Funcionario): bool
  +remover_venda(venda: Venda): bool
  +remover_locacao(locacao: Locacao): bool
}
Funcionario --> Role : "é um"
class Cliente {
  -_id: uuid
  -_nome: str
  -_telefone: str
  -_email: str
  -_endereco: Endereco
  
  +Cliente(id: uuid, nome: str, telefone: str, email: str, endereco: Endereco)
}

class Endereco{
  -_id: uuid
  -_uf: str
  -_cidade: str
  -_logradouro: str
  -_numero: str
  +Endereco(id:uuid, uf: str, cidade: str, logradouro:str, numero: str)
}

class Venda {
  -_id:uuid
  -_data: date
  -_valor: float
  -_locador: Cliente
  -_veiculo: Veiculo
  -_cliente: Cliente

  +Venda(data: date, valor: float, cliente: Cliente, vendedor: Funcionario)
}

class Locacao {
  -_id:uuid
  -_data_inicio: date
  -_data_fim: date
  -_valor_diaria: float
  -_locador: Cliente
  -_veiculo: Veiculo
  -_cliente: Cliente

  +Locacao(data: date, valor: float, cliente: Cliente, vendedor: Funcionario)
}

class Veiculo {
  -_id:uuid
  -_marca: str
  -_modelo: str
  -_ano: int
  -_preco: float
  -_valor_diaria: float
  -_disponivel: bool
  -_cor:str
  +Veiculo(id: uuid, marca: str, modelo: str, ano: int, preco: float, valor_diaria, cor: str)
  +get_disponivel(): bool
}

Venda *-- Veiculo : "é vendido"
Venda o-- Cliente : "faz"
Venda o-- Funcionario : "realiza"

Locacao *-- Veiculo : "é locado"
Locacao o-- Cliente : "faz"
Locacao o-- Funcionario : "realiza"

Cliente *-- Endereco
@enduml
